results/experiments/c1/validation/c1-validation-002/k6/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/kubernetes_checkout.js
        output: json (/results/k6-timeseries.jsonl)

     scenarios: (100.00%) 1 scenario, 300 max VUs, 2m0s max duration (incl. graceful stop):
              * kubernetes_checkout: Up to 8.00 iterations/s for 1m30s over 4 stages (maxVUs: 100-300, gracefulStop: 30s)


running (0m01.0s), 000/100 VUs, 0 complete and 0 interrupted iterations
kubernetes_checkout   [   1% ] 000/100 VUs  0m01.0s/1m30s  1.02 iters/s

running (0m02.0s), 001/100 VUs, 1 complete and 0 interrupted iterations
kubernetes_checkout   [   2% ] 001/100 VUs  0m02.0s/1m30s  1.12 iters/s

running (0m03.0s), 000/100 VUs, 3 complete and 0 interrupted iterations
kubernetes_checkout   [   3% ] 000/100 VUs  0m03.0s/1m30s  1.16 iters/s

running (0m04.0s), 000/100 VUs, 4 complete and 0 interrupted iterations
kubernetes_checkout   [   4% ] 000/100 VUs  0m04.0s/1m30s  1.20 iters/s

running (0m05.0s), 000/100 VUs, 5 complete and 0 interrupted iterations
kubernetes_checkout   [   6% ] 000/100 VUs  0m05.0s/1m30s  1.24 iters/s

running (0m06.0s), 000/100 VUs, 6 complete and 0 interrupted iterations
kubernetes_checkout   [   7% ] 000/100 VUs  0m06.0s/1m30s  1.28 iters/s

running (0m07.0s), 000/100 VUs, 8 complete and 0 interrupted iterations
kubernetes_checkout   [   8% ] 000/100 VUs  0m07.0s/1m30s  1.36 iters/s

running (0m08.0s), 000/100 VUs, 9 complete and 0 interrupted iterations
kubernetes_checkout   [   9% ] 000/100 VUs  0m08.0s/1m30s  1.40 iters/s

running (0m09.0s), 000/100 VUs, 10 complete and 0 interrupted iterations
kubernetes_checkout   [  10% ] 000/100 VUs  0m09.0s/1m30s  1.43 iters/s

running (0m10.0s), 000/100 VUs, 12 complete and 0 interrupted iterations
kubernetes_checkout   [  11% ] 000/100 VUs  0m10.0s/1m30s  1.50 iters/s

running (0m11.0s), 000/100 VUs, 13 complete and 0 interrupted iterations
kubernetes_checkout   [  12% ] 000/100 VUs  0m11.0s/1m30s  1.53 iters/s

running (0m12.0s), 000/100 VUs, 15 complete and 0 interrupted iterations
kubernetes_checkout   [  13% ] 000/100 VUs  0m12.0s/1m30s  1.60 iters/s

running (0m13.0s), 000/100 VUs, 17 complete and 0 interrupted iterations
kubernetes_checkout   [  14% ] 000/100 VUs  0m13.0s/1m30s  1.66 iters/s

running (0m14.0s), 000/100 VUs, 18 complete and 0 interrupted iterations
kubernetes_checkout   [  16% ] 000/100 VUs  0m14.0s/1m30s  1.69 iters/s

running (0m15.0s), 000/100 VUs, 20 complete and 0 interrupted iterations
kubernetes_checkout   [  17% ] 000/100 VUs  0m15.0s/1m30s  1.75 iters/s

running (0m16.0s), 000/100 VUs, 22 complete and 0 interrupted iterations
kubernetes_checkout   [  18% ] 000/100 VUs  0m16.0s/1m30s  1.80 iters/s

running (0m17.0s), 000/100 VUs, 24 complete and 0 interrupted iterations
kubernetes_checkout   [  19% ] 000/100 VUs  0m17.0s/1m30s  1.86 iters/s

running (0m18.0s), 001/100 VUs, 25 complete and 0 interrupted iterations
kubernetes_checkout   [  20% ] 001/100 VUs  0m18.0s/1m30s  1.91 iters/s

running (0m19.0s), 000/100 VUs, 27 complete and 0 interrupted iterations
kubernetes_checkout   [  21% ] 000/100 VUs  0m19.0s/1m30s  1.94 iters/s

running (0m20.0s), 000/100 VUs, 29 complete and 0 interrupted iterations
kubernetes_checkout   [  22% ] 000/100 VUs  0m20.0s/1m30s  1.99 iters/s

running (0m21.0s), 000/100 VUs, 31 complete and 0 interrupted iterations
kubernetes_checkout   [  23% ] 000/100 VUs  0m21.0s/1m30s  2.07 iters/s

running (0m22.0s), 000/100 VUs, 34 complete and 0 interrupted iterations
kubernetes_checkout   [  24% ] 000/100 VUs  0m22.0s/1m30s  2.21 iters/s

running (0m23.0s), 000/100 VUs, 36 complete and 0 interrupted iterations
kubernetes_checkout   [  26% ] 000/100 VUs  0m23.0s/1m30s  2.30 iters/s

running (0m24.0s), 000/100 VUs, 38 complete and 0 interrupted iterations
kubernetes_checkout   [  27% ] 000/100 VUs  0m24.0s/1m30s  2.39 iters/s

running (0m25.0s), 000/100 VUs, 41 complete and 0 interrupted iterations
kubernetes_checkout   [  28% ] 000/100 VUs  0m25.0s/1m30s  2.51 iters/s

running (0m26.0s), 000/100 VUs, 43 complete and 0 interrupted iterations
kubernetes_checkout   [  29% ] 000/100 VUs  0m26.0s/1m30s  2.59 iters/s

running (0m27.0s), 000/100 VUs, 46 complete and 0 interrupted iterations
kubernetes_checkout   [  30% ] 000/100 VUs  0m27.0s/1m30s  2.70 iters/s

running (0m28.0s), 001/100 VUs, 48 complete and 0 interrupted iterations
kubernetes_checkout   [  31% ] 001/100 VUs  0m28.0s/1m30s  2.81 iters/s

running (0m29.0s), 000/100 VUs, 51 complete and 0 interrupted iterations
kubernetes_checkout   [  32% ] 000/100 VUs  0m29.0s/1m30s  2.88 iters/s

running (0m30.0s), 000/100 VUs, 54 complete and 0 interrupted iterations
kubernetes_checkout   [  33% ] 000/100 VUs  0m30.0s/1m30s  2.98 iters/s

running (0m31.0s), 000/100 VUs, 57 complete and 0 interrupted iterations
kubernetes_checkout   [  34% ] 000/100 VUs  0m31.0s/1m30s  3.08 iters/s

running (0m32.0s), 001/100 VUs, 60 complete and 0 interrupted iterations
kubernetes_checkout   [  36% ] 001/100 VUs  0m32.0s/1m30s  3.21 iters/s

running (0m33.0s), 000/100 VUs, 64 complete and 0 interrupted iterations
kubernetes_checkout   [  37% ] 000/100 VUs  0m33.0s/1m30s  3.30 iters/s

running (0m34.0s), 000/100 VUs, 67 complete and 0 interrupted iterations
kubernetes_checkout   [  38% ] 000/100 VUs  0m34.0s/1m30s  3.39 iters/s

running (0m35.0s), 000/100 VUs, 71 complete and 0 interrupted iterations
kubernetes_checkout   [  39% ] 000/100 VUs  0m35.0s/1m30s  3.51 iters/s

running (0m36.0s), 000/100 VUs, 74 complete and 0 interrupted iterations
kubernetes_checkout   [  40% ] 000/100 VUs  0m36.0s/1m30s  3.59 iters/s

running (0m37.0s), 000/100 VUs, 78 complete and 0 interrupted iterations
kubernetes_checkout   [  41% ] 000/100 VUs  0m37.0s/1m30s  3.70 iters/s

running (0m38.0s), 001/100 VUs, 81 complete and 0 interrupted iterations
kubernetes_checkout   [  42% ] 001/100 VUs  0m38.0s/1m30s  3.81 iters/s

running (0m39.0s), 000/100 VUs, 85 complete and 0 interrupted iterations
kubernetes_checkout   [  43% ] 000/100 VUs  0m39.0s/1m30s  3.89 iters/s

running (0m40.0s), 000/100 VUs, 89 complete and 0 interrupted iterations
kubernetes_checkout   [  44% ] 000/100 VUs  0m40.0s/1m30s  3.99 iters/s

running (0m41.0s), 000/100 VUs, 93 complete and 0 interrupted iterations
kubernetes_checkout   [  46% ] 000/100 VUs  0m41.0s/1m30s  4.09 iters/s

running (0m42.0s), 001/100 VUs, 97 complete and 0 interrupted iterations
kubernetes_checkout   [  47% ] 001/100 VUs  0m42.0s/1m30s  4.21 iters/s

running (0m43.0s), 000/100 VUs, 102 complete and 0 interrupted iterations
kubernetes_checkout   [  48% ] 000/100 VUs  0m43.0s/1m30s  4.30 iters/s

running (0m44.0s), 000/100 VUs, 106 complete and 0 interrupted iterations
kubernetes_checkout   [  49% ] 000/100 VUs  0m44.0s/1m30s  4.39 iters/s

running (0m45.0s), 001/100 VUs, 110 complete and 0 interrupted iterations
kubernetes_checkout   [  50% ] 001/100 VUs  0m45.0s/1m30s  4.51 iters/s

running (0m46.0s), 000/100 VUs, 115 complete and 0 interrupted iterations
kubernetes_checkout   [  51% ] 000/100 VUs  0m46.0s/1m30s  4.59 iters/s

running (0m47.0s), 001/100 VUs, 119 complete and 0 interrupted iterations
kubernetes_checkout   [  52% ] 001/100 VUs  0m47.0s/1m30s  4.70 iters/s

running (0m48.0s), 000/100 VUs, 124 complete and 0 interrupted iterations
kubernetes_checkout   [  53% ] 000/100 VUs  0m48.0s/1m30s  4.79 iters/s

running (0m49.0s), 000/100 VUs, 129 complete and 0 interrupted iterations
kubernetes_checkout   [  54% ] 000/100 VUs  0m49.0s/1m30s  4.89 iters/s

running (0m50.0s), 000/100 VUs, 134 complete and 0 interrupted iterations
kubernetes_checkout   [  56% ] 000/100 VUs  0m50.0s/1m30s  4.99 iters/s

running (0m51.0s), 000/100 VUs, 139 complete and 0 interrupted iterations
kubernetes_checkout   [  57% ] 000/100 VUs  0m51.0s/1m30s  5.09 iters/s

running (0m52.0s), 000/100 VUs, 144 complete and 0 interrupted iterations
kubernetes_checkout   [  58% ] 000/100 VUs  0m52.0s/1m30s  5.19 iters/s

running (0m53.0s), 000/100 VUs, 150 complete and 0 interrupted iterations
kubernetes_checkout   [  59% ] 000/100 VUs  0m53.0s/1m30s  5.30 iters/s

running (0m54.0s), 000/100 VUs, 155 complete and 0 interrupted iterations
kubernetes_checkout   [  60% ] 000/100 VUs  0m54.0s/1m30s  5.39 iters/s

running (0m55.0s), 000/100 VUs, 160 complete and 0 interrupted iterations
kubernetes_checkout   [  61% ] 000/100 VUs  0m55.0s/1m30s  5.49 iters/s

running (0m56.0s), 000/100 VUs, 166 complete and 0 interrupted iterations
kubernetes_checkout   [  62% ] 000/100 VUs  0m56.0s/1m30s  5.59 iters/s

running (0m57.0s), 000/100 VUs, 172 complete and 0 interrupted iterations
kubernetes_checkout   [  63% ] 000/100 VUs  0m57.0s/1m30s  5.70 iters/s

running (0m58.0s), 000/100 VUs, 177 complete and 0 interrupted iterations
kubernetes_checkout   [  64% ] 000/100 VUs  0m58.0s/1m30s  5.79 iters/s

running (0m59.0s), 000/100 VUs, 183 complete and 0 interrupted iterations
kubernetes_checkout   [  66% ] 000/100 VUs  0m59.0s/1m30s  5.89 iters/s

running (1m00.0s), 000/100 VUs, 189 complete and 0 interrupted iterations
kubernetes_checkout   [  67% ] 000/100 VUs  1m00.0s/1m30s  5.99 iters/s

running (1m01.0s), 000/100 VUs, 195 complete and 0 interrupted iterations
kubernetes_checkout   [  68% ] 000/100 VUs  1m01.0s/1m30s  6.09 iters/s

running (1m02.0s), 000/100 VUs, 201 complete and 0 interrupted iterations
kubernetes_checkout   [  69% ] 000/100 VUs  1m02.0s/1m30s  6.19 iters/s

running (1m03.0s), 000/100 VUs, 208 complete and 0 interrupted iterations
kubernetes_checkout   [  70% ] 000/100 VUs  1m03.0s/1m30s  6.30 iters/s

running (1m04.0s), 000/100 VUs, 214 complete and 0 interrupted iterations
kubernetes_checkout   [  71% ] 000/100 VUs  1m04.0s/1m30s  6.40 iters/s

running (1m05.0s), 000/100 VUs, 220 complete and 0 interrupted iterations
kubernetes_checkout   [  72% ] 000/100 VUs  1m05.0s/1m30s  6.49 iters/s

running (1m06.0s), 000/100 VUs, 227 complete and 0 interrupted iterations
kubernetes_checkout   [  73% ] 000/100 VUs  1m06.0s/1m30s  6.60 iters/s

running (1m07.0s), 001/100 VUs, 233 complete and 0 interrupted iterations
kubernetes_checkout   [  74% ] 001/100 VUs  1m07.0s/1m30s  6.70 iters/s

running (1m08.0s), 000/100 VUs, 240 complete and 0 interrupted iterations
kubernetes_checkout   [  76% ] 000/100 VUs  1m08.0s/1m30s  6.79 iters/s

running (1m09.0s), 000/100 VUs, 247 complete and 0 interrupted iterations
kubernetes_checkout   [  77% ] 000/100 VUs  1m09.0s/1m30s  6.89 iters/s

running (1m10.0s), 000/100 VUs, 254 complete and 0 interrupted iterations
kubernetes_checkout   [  78% ] 000/100 VUs  1m10.0s/1m30s  6.99 iters/s

running (1m11.0s), 000/100 VUs, 261 complete and 0 interrupted iterations
kubernetes_checkout   [  79% ] 000/100 VUs  1m11.0s/1m30s  7.09 iters/s

running (1m12.0s), 000/100 VUs, 268 complete and 0 interrupted iterations
kubernetes_checkout   [  80% ] 000/100 VUs  1m12.0s/1m30s  7.19 iters/s

running (1m13.0s), 001/100 VUs, 275 complete and 0 interrupted iterations
kubernetes_checkout   [  81% ] 001/100 VUs  1m13.0s/1m30s  7.30 iters/s

running (1m14.0s), 000/100 VUs, 283 complete and 0 interrupted iterations
kubernetes_checkout   [  82% ] 000/100 VUs  1m14.0s/1m30s  7.40 iters/s

running (1m15.0s), 000/100 VUs, 290 complete and 0 interrupted iterations
kubernetes_checkout   [  83% ] 000/100 VUs  1m15.0s/1m30s  7.49 iters/s

running (1m16.0s), 000/100 VUs, 298 complete and 0 interrupted iterations
kubernetes_checkout   [  84% ] 000/100 VUs  1m16.0s/1m30s  7.60 iters/s

running (1m17.0s), 001/100 VUs, 305 complete and 0 interrupted iterations
kubernetes_checkout   [  86% ] 001/100 VUs  1m17.0s/1m30s  7.70 iters/s

running (1m18.0s), 000/100 VUs, 313 complete and 0 interrupted iterations
kubernetes_checkout   [  87% ] 000/100 VUs  1m18.0s/1m30s  7.79 iters/s

running (1m19.0s), 000/100 VUs, 321 complete and 0 interrupted iterations
kubernetes_checkout   [  88% ] 000/100 VUs  1m19.0s/1m30s  7.89 iters/s

running (1m20.0s), 000/100 VUs, 329 complete and 0 interrupted iterations
kubernetes_checkout   [  89% ] 000/100 VUs  1m20.0s/1m30s  7.99 iters/s

running (1m21.0s), 000/100 VUs, 337 complete and 0 interrupted iterations
kubernetes_checkout   [  90% ] 000/100 VUs  1m21.0s/1m30s  7.21 iters/s

running (1m22.0s), 001/100 VUs, 343 complete and 0 interrupted iterations
kubernetes_checkout   [  91% ] 001/100 VUs  1m22.0s/1m30s  6.39 iters/s

running (1m23.0s), 001/100 VUs, 349 complete and 0 interrupted iterations
kubernetes_checkout   [  92% ] 001/100 VUs  1m23.0s/1m30s  5.59 iters/s

running (1m24.0s), 000/100 VUs, 355 complete and 0 interrupted iterations
kubernetes_checkout   [  93% ] 000/100 VUs  1m24.0s/1m30s  4.82 iters/s

running (1m25.0s), 000/100 VUs, 359 complete and 0 interrupted iterations
kubernetes_checkout   [  94% ] 000/100 VUs  1m25.0s/1m30s  4.10 iters/s

running (1m26.0s), 000/100 VUs, 363 complete and 0 interrupted iterations
kubernetes_checkout   [  96% ] 000/100 VUs  1m26.0s/1m30s  3.22 iters/s

running (1m27.0s), 000/100 VUs, 366 complete and 0 interrupted iterations
kubernetes_checkout   [  97% ] 000/100 VUs  1m27.0s/1m30s  2.36 iters/s

running (1m28.0s), 000/100 VUs, 368 complete and 0 interrupted iterations
kubernetes_checkout   [  98% ] 000/100 VUs  1m28.0s/1m30s  1.53 iters/s

running (1m29.0s), 000/100 VUs, 369 complete and 0 interrupted iterations
kubernetes_checkout   [  99% ] 000/100 VUs  1m29.0s/1m30s  0.63 iters/s

running (1m30.0s), 000/100 VUs, 369 complete and 0 interrupted iterations
kubernetes_checkout   [ 100% ] 000/100 VUs  1m30.0s/1m30s  0.63 iters/s


  █ TOTAL RESULTS 

    checks_total.......: 1845    20.501105/s
    checks_succeeded...: 100.00% 1845 out of 1845
    checks_failed......: 0.00%   0 out of 1845

    ✓ status 201
    ✓ resposta JSON valida
    ✓ possui ID do pedido
    ✓ pedido criado como PENDING
    ✓ possui produto e quantidade

    CUSTOM
    response_duration_2xx..........: avg=31.2ms  min=19.94ms med=25.47ms p(90)=48.99ms p(95)=59.46ms p(99)=78.41ms max=101.45ms count=369
    responses_2xx..................: 369    4.100221/s

    HTTP
    http_req_duration..............: avg=31.2ms  min=19.94ms med=25.47ms p(90)=48.99ms p(95)=59.46ms p(99)=78.41ms max=101.45ms count=369
      { expected_response:true }...: avg=31.2ms  min=19.94ms med=25.47ms p(90)=48.99ms p(95)=59.46ms p(99)=78.41ms max=101.45ms count=369
    http_req_failed................: 0.00%  0 out of 369
    http_reqs......................: 369    4.100221/s

    EXECUTION
    iteration_duration.............: avg=32.31ms min=21.06ms med=26.65ms p(90)=50.04ms p(95)=60.41ms p(99)=80.18ms max=102.28ms count=369
    iterations.....................: 369    4.100221/s
    vus............................: 0      min=0        max=1  
    vus_max........................: 100    min=100      max=100

    NETWORK
    data_received..................: 189 kB 2.1 kB/s
    data_sent......................: 57 kB  631 B/s



running (1m30.0s), 000/100 VUs, 369 complete and 0 interrupted iterations
kubernetes_checkout ✓ [ 100% ] 000/100 VUs  1m30s  0.63 iters/s